{
  "header": {
    "home": "Home",
    "projects": "Projects",
    "presentation": "Presentation",
    "language": {
      "fr": "French",
      "en": "English"
    }
  },
  "homepage": {
    "title": {
      "main": "Rayan, Full-stack",
      "underlined": "developer"
    },
    "description": "I enjoy contributing to the creation of sustainable and scalable technological solutions that shape the world of tomorrow.",
    "buttons": {
      "main": "My projects",
      "left": "LinkedIn",
      "right": "GitHub"
    },
    "projects-title": "Latest projects"
  },
  "hub-projects": {
    "title": "My achievements"
  },
  "project-details": {
    "person": "person",
    "buttons": {
      "return": "Go back",
      "deployed": "Deployed project",
      "repository": "Repository"
    },
    "suggestions-title": "Other projects"
  },
  "projects": {
    "card": {
      "redirect-button": "View project"
    },
    "fruit&go": {
      "details": "E-commerce",
      "description": "Fruit and Go is an e-commerce application designed for a greengrocer and for selling general food products. The main objective is to allow customers to order online and have their orders delivered directly to their homes.",
      "imageAlt": "Presentation image of the Fruit&Go project",
      "time": "6 months",
      "feature1": {
        "title": "Introduction",
        "desc": "The idea for this project arose from the greengrocer's desire to adopt a delivery ordering system to better manage periods of high traffic and provide a smoother customer experience. With this application, the greengrocer can expand their market and optimize revenue by simplifying access to products. In this project, I collaborated with a UX/UI expert who handled graphic assets, such as site illustrations and the introductory video.",
        "imageAlt": "Presentation image of the Fruit&Go project"
      },
      "feature2": {
        "title": "Dynamic cart",
        "desc": "The dynamic cart is one of the key features of the application. Accessible at the top right of the screen, it allows users to track in real-time the items they add. A dedicated cart page provides a complete and interactive view where users can see their products, modify quantities, or remove items. The total price is automatically updated, offering a smooth and intuitive ordering experience. This feature enhances the shopping experience by making item management simple and transparent.",
        "imageAlt": "Presentation image of the Fruit&Go project"
      },
      "feature3": {
        "title": "Filtering system",
        "desc": "The application also offers an effective filtering system on the product category page. With this feature, users can refine their search based on various criteria such as product type, availability, or promotions. The filters are dynamic and can work together to provide a personalized browsing experience. Additionally, a button allows users to reset the filters at any time, simplifying catalog exploration.",
        "imageAlt": "Presentation image of the Fruit&Go project"
      },
      "feature4": {
        "title": "Payment with Stripe",
        "desc": "To centralize and facilitate payments, the application is connected to Stripe, a reliable and secure solution. During the ordering process, users are redirected to an integrated Stripe interface where they can finalize their payment securely. For the store manager, Stripe also offers a dedicated platform for tracking billing and orders, simplifying transaction management and financial reporting without the need for complicated third-party systems.",
        "imageAlt": "Presentation image of the Fruit&Go project"
      },
      "feature5": {
        "title": "Content management with Strapi",
        "desc": "The site is connected to Strapi, a Headless CMS that allows the manager to intuitively manage site content without needing to rely on the development team. Through this interface, they can control all textual and visual content on the various pages, manage the product list, and highlight certain items in suggestions. This integration provides complete autonomy for the manager to adjust content based on business needs, facilitating daily site management.",
        "imageAlt": "Presentation image of the Fruit&Go project"
      },
      "feature6": {
        "title": "Content Management with Strapi",
        "desc": "The site is connected to Strapi, a Headless CMS that allows the manager to intuitively handle site content without needing the development team. Through this interface, they can control all text and visual content across various pages, manage the product list, and highlight specific products in suggestions. This integration provides the manager with full autonomy to adjust content according to business needs, simplifying the daily management of the site.",
        "imageAlt": "Content management feature with Strapi in the Fruit&Go project"
      }
    },
    "fountain_finder": {
      "details": "Map of fountains in Paris",
      "description": "Fountain Finder is an application designed to check the real-time availability of water fountains in Paris. Availability here means that the fountains are actually providing water. This project offers a practical solution for users looking to quickly find a working fountain in Paris.",
      "imageAlt": "Presentation image of the Fountain Finder project",
      "time": "3 days",
      "feature1": {
        "title": "Introduction",
        "desc": "This project emerged from the desire to modernize an initial concept developed during a university project, which had been created using HTML, CSS, and JavaScript. The new version uses React to provide a more efficient and optimized application. It also features a modernized user interface (UI), with new sliders and an overall improvement in visual and interactive experience.",
        "imageAlt": "Presentation image of the Fountain Finder project"
      },
      "feature2": {
        "title": "Map of Paris",
        "desc": "The application relies on a map of Paris provided by the Leaflet library. This map displays in detail the streets, districts, and buildings of the city, offering a comprehensive view of Paris and facilitating navigation. The integration of Leaflet allows for a dynamic map that follows user interactions while remaining lightweight and fast.",
        "imageAlt": "Map of Paris in Fountain Finder"
      },
      "feature3": {
        "title": "Displaying fountains",
        "desc": "The water fountains in Paris are retrieved from the Paris water API, which lists all the fountains in the city and its surroundings. Each fountain is represented on the map with key information such as the street it is located on, its type (classic fountain, water wall, etc.), and importantly, its availability. This feature provides a clear view of the state of fountains at any time.",
        "imageAlt": "Displaying fountains on the map in Fountain Finder"
      },
      "feature4": {
        "title": "Fountain clusters",
        "desc": "Displaying several thousand points of interest, such as fountains, can quickly burden the application and affect its performance. To avoid this, I implemented a clustering system. These clusters group together several geographically close fountains, thus reducing the number of elements displayed at once and optimizing performance. Each cluster shows the number of fountains present in its area, providing a quick overview without overwhelming the screen.",
        "imageAlt": "Clustering system for fountains in Fountain Finder"
      },
      "feature5": {
        "title": "Custom markers",
        "desc": "The markers for the fountains have been completely customized for this version of the application. Unlike the standard markers provided by Leaflet, I designed specific markers that display an image corresponding to the type of fountain. This allows for better visual distinction between different types of fountains, enhancing the user experience. This is an improvement over the previous version, where a single type of marker was used for all fountains.",
        "imageAlt": "Custom markers for each type of fountain in Fountain Finder"
      },
      "feature6": {
        "title": "Filter System",
        "desc": "Fountain Finder’s filter system enables precise and customized fountain searches. With advanced options, users can filter fountains by availability (open or closed), by district, and by type of fountain (standard, drinking water, decorative, etc.). A reset button is also available to clear the filters and display all fountains again.",
        "imageAlt": "Customized fountain filter system in Fountain Finder"
      }
    },
    "vibe": {
      "details": "Live video streaming platform",
      "description": "VIBE is a video streaming platform that allows users to broadcast live videos while interacting with their audience in real time. Developed as part of our final year project in the Computer Science Bachelor's program, this project enabled us to acquire practical skills in handling live video streams.",
      "imageAlt": "Presentation image of the VIBE project",
      "time": "9 months",
      "feature1": {
        "title": "Introduction",
        "desc": "The VIBE project was born from our shared passion for streaming platforms. We aimed to create a practical and functional application for content creators. This project allowed us to develop a wide range of technical skills while working together to deliver a cohesive and polished product. With modern features such as live streaming, user account management, and an intuitive interface, VIBE stands out as a powerful and versatile solution for real-time content broadcasting.",
        "imageAlt": "Presentation image of the VIBE project"
      },
      "feature2": {
        "title": "Homepage",
        "desc": "The homepage highlights followed streams, featured content in carousels, and the most popular streaming categories. Users can also view their friends’ activity in real time.",
        "imageAlt": "Overview of the VIBE homepage"
      },
      "feature3": {
        "title": "User Accounts and Profiles",
        "desc": "Users can register, log in, and fully manage their profiles—editing their photo, bio, and username—or delete their account permanently. A personal dashboard gives full control over their profile.",
        "imageAlt": "User profile management interface"
      },
      "feature4": {
        "title": "Streaming Dashboard",
        "desc": "A dedicated dashboard allows streamers to configure their streams: title, category, type of content, and custom thumbnails—similar to professional platforms like YouTube.",
        "imageAlt": "Live stream setup dashboard"
      },
      "feature5": {
        "title": "Live Page",
        "desc": "When a stream is launched via OBS, viewers can access it from the homepage or via a direct URL. The live page includes the video stream, viewer count, live chat, subscribe button, and a donation system connected to Stripe. Once the stream ends, the page automatically switches to offline mode.",
        "imageAlt": "Live broadcast preview on VIBE"
      },
      "feature6": {
        "title": "Community Management",
        "desc": "Streamers can moderate their community by banning users from the chat. Banned users are listed with ban dates and an option to unban them. Banned users are blocked from viewing the streamer's content.",
        "imageAlt": "Community management features"
      },
      "feature7": {
        "title": "Friends and Chat System",
        "desc": "A friend system lets users send and accept friend requests. Friends appear in a list and can exchange messages through a real-time chat with timestamps and message history.",
        "imageAlt": "Friend and chat management on the platform"
      }
    },
    "g3d": {
      "details": "3D Scenes",
      "description": "G3D is a web-based application (SaaS) designed for the creation, visualization, and manipulation of 3D scenes directly in the browser. Inspired by collaborative tools like Figma, G3D aims to become a go-to platform for real-time collaborative 3D design.\nCurrently developed in React.js, a migration to Next.js is planned to optimize SEO and improve the application's overall performance.",
      "imageAlt": "Presentation image of the G3D project",
      "time": "1 month",
      "feature1": {
        "title": "Project Origins",
        "desc": "This project was born from a personal desire to explore 3D on the web — a domain I had not yet explored. A friend of mine, who is passionate about Blender, supported me during the design phase by helping me understand the technical foundations of 3D and by collaborating on the UI mockups.",
        "imageAlt": "Introduction image of the G3D project"
      },
      "feature2": {
        "title": "Real-Time Scene Display",
        "desc": "The G3D interface displays the active 3D scene in real time. To aid navigation and spatial awareness, a visible grid made of 1-meter squares is shown, along with two guiding lines representing the X and Y axes.",
        "imageAlt": "Scene display feature of the G3D project"
      },
      "feature3": {
        "title": "Intuitive 3D Shape Creation",
        "desc": "Creating meshes (3D shapes) is straightforward via the menu in the top-left corner of the interface. Simply select a shape from the dropdown, and it will be automatically added to the center of the scene. Users can currently create basic shapes, both in 2D (circle, square) and 3D (sphere, cube).",
        "imageAlt": "Shape creation feature of the G3D project"
      },
      "feature4": {
        "title": "Real-Time Editing and Transformation",
        "desc": "Meshes can be selected individually by clicking on them, or in groups using Ctrl + click. When one or more meshes are selected, a right-hand side panel appears automatically. This panel allows users to modify core properties such as position, scale (size), and rotation in 3D space.",
        "imageAlt": "Real-time editing feature of the G3D project"
      }
    },
    "worknest": {
      "details": "Interactive map of coworking spaces in Paris",
      "description": "Worknest is a platform dedicated to the analysis and localization of coworking spaces within the Parisian area. It helps future managers identify optimal locations to establish coworking spaces, based on key criteria like price per square meter, transport density, and proximity to restaurants.",
      "imageAlt": "Project presentation image of Worknest",
      "time": "1 month",
      "feature1": {
        "title": "Introduction",
        "desc": "This project was developed during my first year of engineering studies at ESIEE Paris as part of a web programming course. Together with my partner, we created an interactive map based on CSV files, focused on analyzing coworking spaces in the Paris region, a topic we were particularly interested in.",
        "imageAlt": "Introduction image of Worknest project"
      },
      "feature2": {
        "title": "Map and markers display",
        "desc": "Using Leaflet.js, we displayed a clean map of Paris, showing coworking spaces represented by custom markers. A clustering system groups nearby locations to improve map readability.",
        "imageAlt": "Map and markers feature of the Worknest project"
      },
      "feature3": {
        "title": "Business district colorization",
        "desc": "The map also colorizes Paris business districts based on key criteria, allowing users to quickly identify the most interesting zones to open a coworking space.",
        "imageAlt": "Business district colorization feature of the Worknest project"
      },
      "feature4": {
        "title": "Dynamic filters",
        "desc": "The menu lets users filter the map by arrondissement, business district, and criteria such as price per m², transport density, or restaurant density. Filters can be combined, and the map updates in real time. The menu can also be hidden for better readability.",
        "imageAlt": "Dynamic filters feature of the Worknest project"
      },
      "feature5": {
        "title": "Dynamic legend",
        "desc": "A contextual legend at the bottom of the map adapts automatically to the selected filters, explaining colors, indices, and visual aids to facilitate understanding of data related to Parisian coworking spaces.",
        "imageAlt": "Dynamic legend feature of the Worknest project"
      },
      "feature6": {
        "title": "Zone details",
        "desc": "By clicking on a Paris business district, users can view key data related to coworking spaces based on applied filters: overall index, number of restaurants, transport density, average price per m², etc. This information updates in real time.",
        "imageAlt": "Zone details feature of the Worknest project"
      }
    }
  },
  "presentation": {
    "fullname": "Rayan Ainouche",
    "position": "Fullstack developer",
    "location": "Paris, Île-de-france",
    "phone": "07 61 54 34 37",
    "profile": {
      "title": "Profile.",
      "description": "Passionate web developer with three years of experience, I am currently seeking a new apprenticeship opportunity in Fullstack development starting in September 2025. This would be part of my engineering program at ESIEE Paris, where I specialize in computer science, design, architecture, and development, for a duration of two years."
    },

    "experience": {
      "nav-label": "Experiences",
      "capgemini": {
        "title": "Capgemini",
        "position": "Fullstack Developer",
        "years": "Sept. 2022 - Aug. 2024",
        "aeroport-paris": {
          "title": "Aéroports de Paris",
          "date": "Mar. 2024 - Jul. 2024",
          "achievement1": "Development of web components in React.js & TypeScript.",
          "achievement2": "Implementation of the Material UI component library.",
          "achievement3": "Writing unit and regression tests (Snapshots).",
          "achievement4": "Deliverable demonstrations internally."
        },
        "fdj": {
          "title": "Française des jeux",
          "date": "Oct. 2022 - Feb. 2024",
          "achievement1": "Development of web components in React.js & TypeScript.",
          "achievement2": "Writing integration tests.",
          "achievement3": "CMS Directus configuration and management.",
          "achievement4": "Development and maintenance of the API in Node.js (Fastify).",
          "achievement5": "Deliverable demonstrations for the client.",
          "achievement6": "Organization following the AGILE methodology.",
          "achievement7": "Learning React.js and JavaScript within a week."
        }
      },
      "genius": {
        "title": "Genius Gambler",
        "position": "Fullstack Developer",
        "years": "Sept. 2024 - Aug. 2025",
        "achievements": {
          "achievement1": "Fully implemented the back-office front-end using Flutter Web",
          "achievement2": "Developed the back-end with Java Spring Boot & Firebase",
          "achievement3": "Contributed to bug identification, tracking, and reporting",
          "achievement4": "Analyzed mobile app features and architecture, providing optimization suggestions"
        }
      }
    },
    "education": {
      "nav-label": "Education",
      "esiee": {
        "title": "ESIEE Paris",
        "diploma": "Software Engineer",
        "years": "2024 - 2027",
        "desc": "I am currently studying at ESIEE Paris, specializing in software engineering, architectural design, and programming. I have completed the first year of my program and continue to receive advanced training in these key areas of computer science. ESIEE Paris is recognized as one of the top engineering schools in computer science in France."
      },
      "iut": {
        "title": "IUT de Paris - Rives de Seine",
        "diploma": "Bachelor of Sciences in Computer Science",
        "years": "2022 - 2024",
        "desc": "I successfully joined IUT de Paris - Rives de Seine, known as one of the best institutes in computer science in France. There, I received a solid education covering all aspects of IT: networks, databases, and development, with a particular focus on Java and PHP. In parallel, I furthered my personal knowledge by specializing in React and JavaScript during my free time."
      },
      "high-school": {
        "title": "Lycée Charlemagne",
        "diploma": "High School Diploma",
        "years": "2018 - 2021",
        "desc": "I spent my high school years at Lycée Charlemagne, one of the top high schools in France, located in the heart of Paris. I benefited from a rigorous environment with demanding teachers, which allowed me to develop strong skills. I pursued specialties in mathematics and computer science, nurturing my interest in these fields from my early years of study."
      }
    },
    "skills": {
      "hard-skills-title": "Skills",
      "soft-skills-title": "Soft Skills",
      "soft-skill1": "Good communication",
      "soft-skill2": "Autonomy",
      "soft-skill3": "AGILE methodology",
      "soft-skill4": "Organization",
      "soft-skill5": "Team collaboration",
      "soft-skill6": "Analytical mindset"
    },
    "languages": {
      "title": "Languages",
      "en": "English: Advanced (C1)",
      "es": "Spanish: Intermediate (B1)"
    },
    "interests": {
      "title": "Interests",
      "interest1": "Passionate about travel",
      "interest2": "Dedicated to sports",
      "interest3": "Web development"
    },
    "download-button-label": "Download my CV in PDF"
  }
}
