{
  "header": {
    "home": "Accueil",
    "projects": "Projets",
    "presentation": "Présentation",
    "language": {
      "fr": "Français",
      "en": "Anglais"
    }
  },
  "homepage": {
    "title": {
      "main": "Rayan, développeur",
      "underlined": "Full-stack"
    },
    "description": "J’aime contribuer à la création de solutions technologiques durables et évolutives qui façonnent le monde de demain.",
    "buttons": {
      "main": "Mes projets",
      "left": "LinkedIn",
      "right": "GitHub"
    },
    "projects-title": "Derniers projets"
  },
  "hub-projects": {
    "title": "Mes réalisations"
  },
  "project-details": {
    "person": "personne",

    "buttons": {
      "return": "Retour",
      "deployed": "Projet déployé",
      "unavailable": "Temporairement indisponible",
      "repository": "Dépôt GitHub"
    },
    "suggestions-title": "Autres projets"
  },
  "projects": {
    "card": {
      "redirect-button": "Voir le projet"
    },
    "fruit&go": {
      "details": "E-commerce",
      "description": "Fruit and Go est une application e-commerce conçue pour un primeur et pour la vente d’alimentation générale. L’objectif principal est de permettre à ses clients de passer commande en ligne et de se faire livrer directement chez eux.",
      "imageAlt": "Image de présentation du projet Fruit&Go",
      "time": "6 mois",
      "feature1": {
        "title": "Introduction",
        "desc": "L'idée de ce projet est née de la volonté du primeur d'adopter un système de commande par livraison pour mieux gérer les périodes de forte affluence et offrir une expérience client plus fluide. Grâce à cette application, le primeur peut élargir son marché et optimiser son chiffre d'affaires en simplifiant l'accès à ses produits. Dans ce projet, j’ai travaillé en collaboration avec un expert UX/UI, qui s’est chargé des assets graphiques, tels que les illustrations du site et la vidéo d’introduction.",
        "imageAlt": "Image d'introduction du projet Fruit&go"
      },
      "feature2": {
        "title": "Panier dynamique",
        "desc": "Le panier dynamique est l'une des fonctionnalités clés de l'application. Accessible en haut à droite de l'écran, il permet aux utilisateurs de suivre en temps réel les articles qu'ils ajoutent. Une page dédiée au panier offre une vue complète et interactive où l'utilisateur peut voir ses produits, modifier la quantité ou supprimer des articles. Le prix total est automatiquement mis à jour, offrant une expérience de commande fluide et intuitive. Cette fonctionnalité améliore l'expérience d'achat, en rendant la gestion des articles ajoutés simple et transparente.",
        "imageAlt": "Fonctionnalité panier dynamique du projet Fruit&go"
      },
      "feature3": {
        "title": "Système de filtres",
        "desc": "L'application propose également un système de filtres efficace sur la page des catégories de produits. Grâce à cette fonctionnalité, les utilisateurs peuvent affiner leur recherche en fonction de différents critères, tels que le type de produit, la disponibilité ou encore les promotions. Les filtres sont dynamiques et peuvent fonctionner ensemble pour offrir une expérience de navigation personnalisée. De plus, un bouton permet de réinitialiser les filtres à tout moment, ce qui simplifie l'exploration du catalogue pour l'utilisateur.",
        "imageAlt": "Fonctionnalité filtres du projet Fruit&go"
      },
      "feature4": {
        "title": "Paiement avec Stripe",
        "desc": "Afin de centraliser et faciliter les paiements, l'application est reliée à Stripe, une solution fiable et sécurisée. Lors du processus de commande, les utilisateurs sont redirigés vers une interface Stripe intégrée, où ils peuvent finaliser leur paiement en toute sécurité. Pour le gérant du magasin, Stripe offre également une plateforme dédiée pour le suivi des facturations et des commandes. Cela permet une gestion simplifiée des transactions et des rapports financiers, sans avoir à passer par des systèmes tiers compliqués.",
        "imageAlt": "Fonctionnalité paiement avec Stripe du projet Fruit&go"
      },
      "feature5": {
        "title": "Interface administrateur.",
        "desc": "L'interface administrateur de Fruit&Go offre une vue complète et en temps réel sur les commandes clients, de leur réception à la livraison. Chaque commande est présentée sous forme de carte détaillant les informations essentielles, comme les produits et le client. Un bouton de statut, accessible sur chaque carte, permet à l’administrateur de mettre facilement à jour l’avancement de la commande.",
        "imageAlt": "Fonctionnalité interface administrateur du projet Fruit&go"
      },
      "feature6": {
        "title": "Gestion du contenu avec Strapi",
        "desc": "Le site est connecté à Strapi, un CMS Headless qui permet au gérant de gérer de manière intuitive le contenu du site sans avoir à solliciter l'équipe de développement. Grâce à cette interface, il peut contrôler l’ensemble du contenu textuel et visuel des différentes pages, gérer la liste des produits et mettre en avant certains d'entre eux dans les suggestions. Cette intégration offre une autonomie complète au gérant pour ajuster les contenus en fonction des besoins commerciaux, facilitant ainsi la gestion quotidienne du site.",
        "imageAlt": "Fonctionnalité gestion du contenu avec Strapi du projet Fruit&go"
      }
    },
    "fountain_finder": {
      "details": "Carte des fontaines de Paris",
      "description": "Fountain Finder est une application conçue pour vérifier en temps réel la disponibilité des fontaines à eau de Paris. La disponibilité signifie ici que les fontaines fournissent effectivement de l'eau. Ce projet offre une solution pratique pour les utilisateurs qui souhaitent trouver rapidement une fontaine en état de marche dans Paris.",
      "imageAlt": "Image de présentation du projet Fountain Finder",
      "time": "3 jours",
      "feature1": {
        "title": "Introduction",
        "desc": "Ce projet est né de l'envie de moderniser un concept initial développé lors d’un projet universitaire, qui avait été réalisé en HTML, CSS et JavaScript. La nouvelle version utilise React pour proposer une application plus performante et optimisée. Elle apporte aussi une interface utilisateur (UI) modernisée, avec de nouveaux curseurs et une amélioration générale de l’expérience visuelle et interactive.",
        "imageAlt": "Image de présentation du projet Fountain Finder"
      },
      "feature2": {
        "title": "Carte de Paris",
        "desc": "L’application s’appuie sur une carte de Paris fournie par la bibliothèque Leaflet. Cette carte affiche en détail les rues, arrondissements, et bâtiments de la ville, offrant une vue complète de Paris et facilitant la navigation. L’intégration de Leaflet permet de créer une carte dynamique qui suit les interactions des utilisateurs tout en restant légère et rapide.",
        "imageAlt": "Image de la carte de Paris dans Fountain Finder"
      },
      "feature3": {
        "title": "Affichage des fontaines",
        "desc": "Les fontaines à eau de Paris sont récupérées à partir de l’API des eaux de Paris, qui répertorie toutes les fontaines de la ville et ses environs. Chaque fontaine est représentée sur la carte avec des informations clés telles que la rue où elle se trouve, son type (fontaine classique, mur d’eau, etc.) et surtout sa disponibilité. Cette fonctionnalité permet d’avoir une vue claire de l’état des fontaines à tout moment.",
        "imageAlt": "Affichage des fontaines sur la carte dans Fountain Finder"
      },
      "feature4": {
        "title": "Clusters de fontaines",
        "desc": "Afficher plusieurs milliers de points d’intérêts, comme les fontaines, peut rapidement alourdir l’application et affecter ses performances. Pour éviter cela, j’ai implémenté un système de clusters. Ces clusters regroupent plusieurs fontaines proches géographiquement, réduisant ainsi le nombre d'éléments affichés en même temps et optimisant les performances. Chaque cluster affiche le nombre de fontaines présentes dans sa zone, offrant un aperçu rapide sans surcharger l’écran.",
        "imageAlt": "Système de clusters pour les fontaines sur Fountain Finder"
      },
      "feature5": {
        "title": "Markers personnalisés",
        "desc": "Les markers des fontaines ont été entièrement personnalisés pour cette version de l’application. Contrairement aux markers standards fournis par Leaflet, j’ai conçu des markers spécifiques qui affichent une image correspondant au type de fontaine. Cela permet une meilleure distinction visuelle entre les différents types de fontaines, améliorant ainsi l'expérience utilisateur. C’est une évolution par rapport à la version précédente, où un seul type de marker était utilisé pour toutes les fontaines.",
        "imageAlt": "Markers personnalisés pour chaque type de fontaine dans Fountain Finder"
      },
      "feature6": {
        "title": "Système de filtres",
        "desc": "Le système de filtres de Fountain Finder permet une recherche précise et personnalisée des fontaines. Grâce à des options avancées, l’utilisateur peut filtrer les fontaines par disponibilité (ouvertes ou fermées), par arrondissement, et par type de fontaine (classique, à eau potable, décorative, etc.). Un bouton de réinitialisation est également disponible pour remettre les filtres à zéro et afficher à nouveau toutes les fontaines.",
        "imageAlt": "Système de filtres des fontaines personnalisés dans Fountain Finder"
      }
    },
    "vibe": {
      "details": "Plateforme de diffusion de vidéos en direct",
      "description": "VIBE est une plateforme de streaming vidéo qui permet aux utilisateurs de diffuser des vidéos en direct tout en interagissant en temps réel avec leur audience. Ce projet a été développé dans le cadre de notre projet annuel de dernière année de BUT Informatique, visant à acquérir des compétences dans la manipulation de flux vidéo en direct.",
      "imageAlt": "Image de présentation du projet VIBE",
      "time": "9 mois",
      "feature1": {
        "title": "Introduction",
        "desc": "Le projet VIBE est le fruit de la passion partagée par notre équipe pour les plateformes de streaming. Nous avons souhaité créer une application pratique et fonctionnelle pour les créateurs de contenu vidéo. Ce projet nous a permis de mettre en œuvre diverses compétences techniques tout en collaborant pour produire un produit final cohérent et abouti. En intégrant des fonctionnalités modernes comme la diffusion en direct, la gestion des comptes utilisateurs, et des interfaces intuitives, VIBE se positionne comme une plateforme puissante et polyvalente pour la diffusion de contenu en direct.",
        "imageAlt": "Image de présentation du projet VIBE"
      }
    },
    "g3d": {
      "details": "Scènes 3D",
      "description": "G3D est une application web (SaaS) dédiée à la création, la visualisation et la manipulation de scènes 3D directement depuis un navigateur. Inspirée par des outils collaboratifs comme Figma, G3D vise à devenir une plateforme de référence pour la conception 3D collaborative en temps réel.\nActuellement développée en React.js, une migration vers Next.js est prévue afin d’optimiser le référencement et d’améliorer les performances globales de l’application.",
      "imageAlt": "Image de présentation du projet G3D",
      "time": "1 mois",
      "feature1": {
        "title": "Introduction",
        "desc": "Ce projet est né d'une volonté personnelle d'explorer l'univers de la 3D sur le web, un domaine encore nouveau pour moi. Un ami passionné par Blender m’a accompagné dans la phase de conception, en m’aidant à comprendre les fondements techniques de la 3D et en collaborant à l’élaboration des maquettes de l’interface.",
        "imageAlt": "Image d'introduction du projet G3D"
      },
      "feature2": {
        "title": "Affichage en temps réel de la scène",
        "desc": "L’interface de G3D permet d’afficher en temps réel la scène en cours de construction. Pour aider à la navigation et à la perception de l’espace, une grille quadrillée est visible, composée de cases de 1 mètre par 1 mètre, ainsi que deux lignes repères indiquant les directions des axes X et Y.",
        "imageAlt": "Fonctionnalité d'affichage de la scène du projet G3D"
      },
      "feature3": {
        "title": "Création intuitive de formes 3D",
        "desc": "La création de meshs (formes 3D) se fait facilement à partir du menu situé en haut à gauche de l’interface. Il suffit de sélectionner une forme dans un menu déroulant, et celle-ci sera automatiquement ajoutée au centre de la scène. Il est actuellement possible de créer plusieurs formes de base, aussi bien en 2D (cercle, carré) qu’en 3D (sphère, cube).",
        "imageAlt": "Fonctionnalité création de formes du projet G3D"
      },
      "feature4": {
        "title": "Modification et transformation en temps réel",
        "desc": "La sélection des meshs peut se faire individuellement en cliquant dessus, ou par sélection multiple via Ctrl + clic. Lorsqu’un ou plusieurs meshs sont sélectionnés, un panneau latéral droit s’affiche automatiquement. Ce menu permet de modifier les propriétés fondamentales des objets sélectionnés, à savoir leur position, leur échelle (taille), ainsi que leur rotation dans l’espace.",
        "imageAlt": "Fonctionnalité édition en temps réel du projet G3D"
      }
    },
    "worknest": {
      "details": "Carte des espaces de coworking à Paris",
      "description": "Worknest est une plateforme dédiée à l’analyse et à la localisation des espaces de coworking dans l’espace parisien. Elle aide les futurs gestionnaires à identifier les emplacements optimaux pour implanter leur coworking, en s’appuyant sur des critères clés comme le prix au m², la densité des transports et la proximité des restaurants.",
      "imageAlt": "Image de présentation du projet Worknest",
      "time": "1 mois",
      "feature1": {
        "title": "Introduction",
        "desc": "Ce projet a été réalisé durant ma première année d’ingénierie à l’ESIEE Paris dans le cadre d’un module de programmation web. Avec mon binôme, nous avons développé une carte interactive basée sur des fichiers CSV, axée sur l’analyse des espaces de coworking dans la région parisienne, un sujet qui nous intéressait particulièrement.",
        "imageAlt": "Image d'introduction du projet Worknest"
      },
      "feature2": {
        "title": "Affichage de la carte et des marqueurs",
        "desc": "Avec Leaflet.js, nous avons affiché une carte sobre de Paris, illustrant les espaces de coworking par des marqueurs personnalisés. Un système de regroupement (cluster) permet d’optimiser la lisibilité lorsque plusieurs espaces sont proches géographiquement.",
        "imageAlt": "Fonctionnalité d'affichage de la carte du projet Worknest"
      },
      "feature3": {
        "title": "Colorisation des quartiers d’affaires",
        "desc": "La carte affiche également une colorisation des quartiers d’affaires par différents critères clés, pour visualiser les zones parisiennes les plus intéressantes pour ouvrir un espace de coworking.",
        "imageAlt": "Fonctionnalité de colorisation des quartiers du projet Worknest"
      },
      "feature4": {
        "title": "Filtres dynamiques",
        "desc": "Le menu permet de filtrer la carte selon les arrondissements, quartiers d’affaires et critères comme le prix au m², la densité des transports ou des restaurants. Les filtres sont cumulables et la carte se met à jour en temps réel. Il est possible de masquer ce menu pour une meilleure visibilité.",
        "imageAlt": "Fonctionnalité de filtres dynamiques du projet Worknest"
      },
      "feature5": {
        "title": "Légende dynamique",
        "desc": "Une légende contextuelle en bas de la carte s’adapte automatiquement aux filtres sélectionnés, expliquant les couleurs, indices et aides visuelles pour faciliter la compréhension des données spécifiques aux espaces de coworking parisiens.",
        "imageAlt": "Fonctionnalité de légende dynamique du projet Worknest"
      },
      "feature6": {
        "title": "Détails d’une zone géographique",
        "desc": "En cliquant sur un quartier d’affaires parisien, l’utilisateur peut consulter les données clés liées aux espaces de coworking selon les filtres appliqués : indice global, nombre de restaurants, densité des transports, prix moyen au m², etc. Ces informations évoluent en temps réel.",
        "imageAlt": "Fonctionnalité détails de zone du projet Worknest"
      }
    }
  },
  "presentation": {
    "fullname": "Rayan Ainouche",
    "position": "Développeur Fullstack",
    "location": "Paris, Île-de-france",
    "phone": "07 61 54 34 37",
    "profile": {
      "title": "Profil.",
      "description": "Développeur web passionné, et fort de trois années d'expérience, je suis à la recherche d’une nouvelle opportunité d’alternance dans le développement Fullstack pour Septembre 2025, dans le cadre de mon cursus d'ingénieur à l'ESIEE Paris, spécialisé en informatique, design, architecture et développement, pour une durée de deux ans."
    },
    "experience": {
      "nav-label": "Expériences",
      "capgemini": {
        "title": "Capgemini",
        "position": "Développeur Fullstack",
        "years": "Sept. 2022 - Août 2024",
        "aeroport-paris": {
          "title": "Aéroports de Paris",
          "date": "Mar. 2024 - Juil. 2024",
          "achievement1": "Développement de composants web en React.js & TypeScript.",
          "achievement2": "Implémentation de la librairie de composant Material UI.",
          "achievement3": "Rédaction de tests unitaires et de régression (Snapshots).",
          "achievement4": "Démonstration des livrables en interne."
        },
        "fdj": {
          "title": "Française des jeux",
          "date": "Oct. 2022 - Fév. 2024",
          "achievement1": "Développement de composants web en React.js & TypeScript.",
          "achievement2": "Rédaction de tests d’intégration.",
          "achievement3": "Manipulation et configuration du CMS Directus.",
          "achievement4": "Développement et maintenance de l’API en Node.js (Fastify).",
          "achievement5": "Démonstration des livrables au client.",
          "achievement6": "Organisation suivant la méthodologie AGILE.",
          "achievement7": "Apprentissage de React.js et JavaScript en une semaine."
        }
      },
      "genius": {
        "title": "Genius Gambler",
        "position": "Développeur Fullstack",
        "years": "Sept. 2024 - Août 2025",
        "achievements": {
          "achievement1": "Implémentation complète du front-end du back-office en Flutter Web",
          "achievement2": "Développement du back-end en Java Spring Boot & Firebase",
          "achievement3": "Contribution à l’identification, au suivi et au reporting des anomalies",
          "achievement4": "Analyse des fonctionnalités et de l’architecture de l’application mobile, avec suggestions d’optimisation"
        }
      }
    },
    "education": {
      "nav-label": "Formations",
      "esiee": {
        "title": "ESIEE Paris",
        "diploma": "Ingénieur logiciel",
        "years": "2024 - 2027",
        "desc": "Je poursuis actuellement mes études à ESIEE Paris, où je me spécialise dans le génie logiciel, la conception architecturale et la programmation. J'ai terminé la première année de mon programme et je continue de bénéficier d'une formation de pointe dans ces domaines cruciaux de l'informatique. ESIEE Paris est reconnue comme l'une des meilleures écoles d'ingénieurs en informatique en France."
      },
      "iut": {
        "title": "IUT de Paris - Rives de Seine",
        "diploma": "BUT informatique",
        "years": "2022 - 2024",
        "desc": "J'ai rejoint avec succès l'IUT de Paris Rives de Seine, réputé comme l'un des meilleurs en France dans le domaine informatique. Là-bas, j'ai acquis une solide formation couvrant tous les aspects de l'informatique : réseaux, bases de données, et développement, avec une attention particulière portée sur Java et PHP. En parallèle, j'ai approfondi mes connaissances personnelles en me spécialisant dans React et JavaScript durant mon temps libre."
      },
      "high-school": {
        "title": "Lycée Charlemagne",
        "diploma": "Baccalauréat général",
        "years": "2018 - 2021",
        "desc": "J'ai passé mes années lycée au Lycée Charlemagne, l'un des meilleurs lycées français, situé au cœur de Paris. J'y ai bénéficié d'un environnement rigoureux avec des professeurs exigeants, ce qui m'a permis de développer des compétences solides. J'ai suivi les spécialités mathématiques et informatique, nourrissant ainsi mon intérêt pour ces domaines dès mes premières années d'études."
      }
    },
    "skills": {
      "hard-skills-title": "Compétences",
      "soft-skills-title": "Soft skills",
      "soft-skill1": "Bonne communication",
      "soft-skill2": "Autonomie",
      "soft-skill3": "Méthodologie AGILE",
      "soft-skill4": "Organisation",
      "soft-skill5": "Collaboration en équipe",
      "soft-skill6": "Esprit d’analyse"
    },
    "languages": {
      "title": "Langues",
      "en": "Anglais : Avancé (C1)",
      "es": "Espagnol : intermédiaire (B1)"
    },
    "interests": {
      "title": "Intérets",
      "interest1": "Passionné de voyage",
      "interest2": "Sportif assidu",
      "interest3": "Développement web"
    },
    "download-button-label": "Télécharger mon CV en PDF"
  }
}
